# Sean Kaliszewski
## Week 14 - 4/25/21
### Python - Pandas DataFrame - Griuping and Mapping

In [1]:
import numpy as np
from pandas import Series,DataFrame
import pandas as pd

In [2]:
#mapping
df = DataFrame({'city':['Alma', 'Brian Head', 'Fox Park', 'Lake Mary'],
               'altitude':[10355,9800,9062,8966]})
df

         city  altitude
0        Alma     10355
1  Brian Head      9800
2    Fox Park      9062
3   Lake Mary      8966

In [5]:
st_map = {'Alma':'Colorado', 'Brian Head':'Utah', 'Fox Park':'Wyoming', 'Lake Mary':'California'}
st_map

{'Alma': 'Colorado',
 'Brian Head': 'Utah',
 'Fox Park': 'Wyoming',
 'Lake Mary': 'California'}

In [6]:
df['state'] = df['city'].map(st_map)
df

         city  altitude       state
0        Alma     10355    Colorado
1  Brian Head      9800        Utah
2    Fox Park      9062     Wyoming
3   Lake Mary      8966  California

In [11]:
#apply
def meter(x):
    return x / 3.2808

In [14]:
df['altitude'] = df['altitude'].apply(meter)
df

         city   altitude       state
0        Alma  26.436965    Colorado
1  Brian Head  25.020015        Utah
2    Fox Park  23.135855     Wyoming
3   Lake Mary  22.890761  California

In [15]:
#Numbers for altitude are so low because I ran the code multiple times on accident

In [16]:
df = DataFrame(np.random.randn(4,3), columns=list('bde'),
              index=['UT', 'OH', 'TX', 'OR'])
df

           b         d         e
UT -0.239301 -1.045635  0.221355
OH -0.256485  0.971093 -1.603443
TX  0.758803 -0.968190  1.871346
OR  0.248173 -0.754209 -0.378849

In [17]:
def dif(x):
    return x.max() - x.min()

In [18]:
df.apply(dif)

b    1.015289
d    2.016728
e    3.474789
dtype: float64

In [19]:
df.apply(dif,axis=1)

UT    1.266990
OH    2.574536
TX    2.839536
OR    1.002382
dtype: float64

In [20]:
df.apply(pd.value_counts).fillna(0)

             b    d    e
-1.603443  0.0  0.0  1.0
-1.045635  0.0  1.0  0.0
-0.968190  0.0  1.0  0.0
-0.754209  0.0  1.0  0.0
-0.378849  0.0  0.0  1.0
-0.256485  1.0  0.0  0.0
-0.239301  1.0  0.0  0.0
 0.221355  0.0  0.0  1.0
 0.248173  1.0  0.0  0.0
 0.758803  1.0  0.0  0.0
 0.971093  0.0  1.0  0.0
 1.871346  0.0  0.0  1.0

In [22]:
#groupby
df = DataFrame({'k1': ['a','a', 'b', 'b', 'c'],
               'k2': ['one', 'two', 'one', 'two', 'one'],
               'dataset1': np.random.randn(5),
               'dataset2': np.random.randn(5)})
df

  k1   k2  dataset1  dataset2
0  a  one -1.579836 -0.426270
1  a  two -0.475766  0.204109
2  b  one  2.301381 -2.085902
3  b  two -0.199098 -0.952846
4  c  one  2.219590  0.121683

In [24]:
df.groupby('k1').count()

    k2  dataset1  dataset2
k1
a    2         2         2
b    2         2         2
c    1         1         1

In [25]:
df.groupby(['k1', 'k2']).count()

        dataset1  dataset2
k1 k2
a  one         1         1
   two         1         1
b  one         1         1
   two         1         1
c  one         1         1

In [26]:
df

  k1   k2  dataset1  dataset2
0  a  one -1.579836 -0.426270
1  a  two -0.475766  0.204109
2  b  one  2.301381 -2.085902
3  b  two -0.199098 -0.952846
4  c  one  2.219590  0.121683

In [27]:
df.groupby(['k1','k2']).mean()

        dataset1  dataset2
k1 k2
a  one -1.579836 -0.426270
   two -0.475766  0.204109
b  one  2.301381 -2.085902
   two -0.199098 -0.952846
c  one  2.219590  0.121683

In [28]:
group = df.groupby(['k1','k2'])[['dataset1']]
group.mean()

        dataset1
k1 k2
a  one -1.579836
   two -0.475766
b  one  2.301381
   two -0.199098
c  one  2.219590